Revit 2027 API
Polyloop.Centroid Property
 The polygon centroid.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ Centroid { get; }
Public ReadOnly Property Centroid As XYZ
	Get
public:
property XYZ^ Centroid {
	XYZ^ get ();
}
member Centroid : XYZ with get
Property Value
XYZ
See Also
Reference
Polyloop Class
Autodesk.Revit.DB.Analysis Namespace